"1 187 1 4206624770 ,"
"input 1 3 256 256 ,"
" 208 209 212 230 231 232 234 236 237 238 239 243 261 262 263 265 267 268 269 270 271 272 300 303 321 322 323 325 327 328 329 330 334 352 353 354 356 358 359 360 361 362 363 366 384 385 386 388 390 391 392 393 397 415 416 417 419 421 422 423 424 425 426 454 457 475 476 477 479 481 482 483 484 487 505 506 507 509 511 512 513 514 518 536 537 538 540 542 543 544 545 546 547 575 578 596 597 598 600 602 603 604 605 608 626 627 628 630 632 633 634 635 639 657 658 659 661 663 664 665 666 667 668 696 699 717 718 719 721 723 724 725 726 729 747 748 749 751 753 754 755 756 760 778 779 780 782 784 785 786 787 788 789 817 820 838 839 840 842 844 845 846 847 850 868 869 870 872 874 875 876 877 881 899 900 901 903 905 906 907 908 909 910 911 912 input output ,"
"output ,"
" 168 ,"
"Upsample 208 1 1 input 208 1 0 0 0 8 8 ,"
"QuantizedConvolution 209 1 1 208 209 1 3 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"BatchNormCxx 212 1 1 209 212 ,"
"Upsample 230 1 1 input 230 1 0 0 0 8 8 ,"
"QuantizedConvolution 231 1 1 230 232 1 3 128 3 3 1 1 1 1 1 -1 1 1 1 ,"
"QuantizedConvolution 236 1 1 232 236 1 128 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"QuantizedConvolution 234 1 1 232 234 1 128 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Mul 237 2 1 212 236 237 1 ,"
"QuantizedAdd 238 2 1 237 234 238 1 ,"
"PReLU 239 1 1 238 239 1 0 ,"
"QuantizedConvolution 243 1 1 239 243 1 128 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Upsample 261 1 1 input 261 1 0 0 0 8 8 ,"
"QuantizedConvolution 262 1 1 261 263 1 3 128 3 3 1 1 1 1 1 -1 1 1 1 ,"
"QuantizedConvolution 267 1 1 263 267 1 128 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"QuantizedConvolution 265 1 1 263 265 1 128 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Mul 268 2 1 243 267 268 1 ,"
"QuantizedAdd 269 2 1 268 265 269 1 ,"
"PReLU 270 1 1 269 270 1 0 ,"
"QuantizedConvolution 271 1 1 270 271 1 128 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"QuantizedAdd 272 2 1 209 271 272 1 ,"
"Upsample 300 1 1 272 300 1 0 0 0 16 16 ,"
"BatchNormCxx 303 1 1 300 303 ,"
"Upsample 321 1 1 input 321 1 0 0 0 16 16 ,"
"QuantizedConvolution 322 1 1 321 323 1 3 128 3 3 1 1 1 1 1 -1 1 1 1 ,"
"QuantizedConvolution 327 1 1 323 327 1 128 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"QuantizedConvolution 325 1 1 323 325 1 128 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Mul 328 2 1 303 327 328 1 ,"
"QuantizedAdd 329 2 1 328 325 329 1 ,"
"PReLU 330 1 1 329 330 1 0 ,"
"QuantizedConvolution 334 1 1 330 334 1 128 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Upsample 352 1 1 input 352 1 0 0 0 16 16 ,"
"QuantizedConvolution 353 1 1 352 354 1 3 128 3 3 1 1 1 1 1 -1 1 1 1 ,"
"QuantizedConvolution 358 1 1 354 358 1 128 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"QuantizedConvolution 356 1 1 354 356 1 128 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Mul 359 2 1 334 358 359 1 ,"
"QuantizedAdd 360 2 1 359 356 360 1 ,"
"PReLU 361 1 1 360 361 1 0 ,"
"QuantizedConvolution 362 1 1 361 362 1 128 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"QuantizedAdd 363 2 1 300 362 363 1 ,"
"BatchNormCxx 366 1 1 363 366 ,"
"Upsample 384 1 1 input 384 1 0 0 0 16 16 ,"
"QuantizedConvolution 385 1 1 384 386 1 3 128 3 3 1 1 1 1 1 -1 1 1 1 ,"
"QuantizedConvolution 390 1 1 386 390 1 128 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"QuantizedConvolution 388 1 1 386 388 1 128 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Mul 391 2 1 366 390 391 1 ,"
"QuantizedAdd 392 2 1 391 388 392 1 ,"
"PReLU 393 1 1 392 393 1 0 ,"
"QuantizedConvolution 397 1 1 393 397 1 128 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Upsample 415 1 1 input 415 1 0 0 0 16 16 ,"
"QuantizedConvolution 416 1 1 415 417 1 3 128 3 3 1 1 1 1 1 -1 1 1 1 ,"
"QuantizedConvolution 421 1 1 417 421 1 128 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"QuantizedConvolution 419 1 1 417 419 1 128 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Mul 422 2 1 397 421 422 1 ,"
"QuantizedAdd 423 2 1 422 419 423 1 ,"
"PReLU 424 1 1 423 424 1 0 ,"
"QuantizedConvolution 425 1 1 424 425 1 128 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"QuantizedAdd 426 2 1 363 425 426 1 ,"
"Upsample 454 1 1 426 454 1 0 0 0 32 32 ,"
"BatchNormCxx 457 1 1 454 457 ,"
"Upsample 475 1 1 input 475 1 0 0 0 32 32 ,"
"QuantizedConvolution 476 1 1 475 477 1 3 128 3 3 1 1 1 1 1 -1 1 1 1 ,"
"QuantizedConvolution 481 1 1 477 481 1 128 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"QuantizedConvolution 479 1 1 477 479 1 128 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Mul 482 2 1 457 481 482 1 ,"
"QuantizedAdd 483 2 1 482 479 483 1 ,"
"QuantizedConvolution 484 1 1 483 484 1 128 64 1 1 1 1 0 0 0 -1 1 1 0 ,"
"BatchNormCxx 487 1 1 454 487 ,"
"Upsample 505 1 1 input 505 1 0 0 0 32 32 ,"
"QuantizedConvolution 506 1 1 505 507 1 3 128 3 3 1 1 1 1 1 -1 1 1 1 ,"
"QuantizedConvolution 511 1 1 507 511 1 128 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"QuantizedConvolution 509 1 1 507 509 1 128 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Mul 512 2 1 487 511 512 1 ,"
"QuantizedAdd 513 2 1 512 509 513 1 ,"
"PReLU 514 1 1 513 514 1 0 ,"
"QuantizedConvolution 518 1 1 514 518 1 128 64 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Upsample 536 1 1 input 536 1 0 0 0 32 32 ,"
"QuantizedConvolution 537 1 1 536 538 1 3 128 3 3 1 1 1 1 1 -1 1 1 1 ,"
"QuantizedConvolution 542 1 1 538 542 1 128 64 3 3 1 1 1 1 1 -1 1 1 0 ,"
"QuantizedConvolution 540 1 1 538 540 1 128 64 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Mul 543 2 1 518 542 543 1 ,"
"QuantizedAdd 544 2 1 543 540 544 1 ,"
"PReLU 545 1 1 544 545 1 0 ,"
"QuantizedConvolution 546 1 1 545 546 1 64 64 3 3 1 1 1 1 1 -1 1 1 0 ,"
"QuantizedAdd 547 2 1 484 546 547 1 ,"
"Upsample 575 1 1 547 575 1 0 0 0 64 64 ,"
"BatchNormCxx 578 1 1 575 578 ,"
"Upsample 596 1 1 input 596 1 0 0 0 64 64 ,"
"QuantizedConvolution 597 1 1 596 598 1 3 128 3 3 1 1 1 1 1 -1 1 1 1 ,"
"QuantizedConvolution 602 1 1 598 602 1 128 64 3 3 1 1 1 1 1 -1 1 1 0 ,"
"QuantizedConvolution 600 1 1 598 600 1 128 64 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Mul 603 2 1 578 602 603 1 ,"
"QuantizedAdd 604 2 1 603 600 604 1 ,"
"QuantizedConvolution 605 1 1 604 605 1 64 32 1 1 1 1 0 0 0 -1 1 1 0 ,"
"BatchNormCxx 608 1 1 575 608 ,"
"Upsample 626 1 1 input 626 1 0 0 0 64 64 ,"
"QuantizedConvolution 627 1 1 626 628 1 3 128 3 3 1 1 1 1 1 -1 1 1 1 ,"
"QuantizedConvolution 632 1 1 628 632 1 128 64 3 3 1 1 1 1 1 -1 1 1 0 ,"
"QuantizedConvolution 630 1 1 628 630 1 128 64 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Mul 633 2 1 608 632 633 1 ,"
"QuantizedAdd 634 2 1 633 630 634 1 ,"
"PReLU 635 1 1 634 635 1 0 ,"
"QuantizedConvolution 639 1 1 635 639 1 64 32 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Upsample 657 1 1 input 657 1 0 0 0 64 64 ,"
"QuantizedConvolution 658 1 1 657 659 1 3 128 3 3 1 1 1 1 1 -1 1 1 1 ,"
"QuantizedConvolution 663 1 1 659 663 1 128 32 3 3 1 1 1 1 1 -1 1 1 0 ,"
"QuantizedConvolution 661 1 1 659 661 1 128 32 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Mul 664 2 1 639 663 664 1 ,"
"QuantizedAdd 665 2 1 664 661 665 1 ,"
"PReLU 666 1 1 665 666 1 0 ,"
"QuantizedConvolution 667 1 1 666 667 1 32 32 3 3 1 1 1 1 1 -1 1 1 0 ,"
"QuantizedAdd 668 2 1 605 667 668 1 ,"
"Upsample 696 1 1 668 696 1 0 0 0 128 128 ,"
"BatchNormCxx 699 1 1 696 699 ,"
"Upsample 717 1 1 input 717 1 0 0 0 128 128 ,"
"QuantizedConvolution 718 1 1 717 719 1 3 128 3 3 1 1 1 1 1 -1 1 1 1 ,"
"QuantizedConvolution 723 1 1 719 723 1 128 32 3 3 1 1 1 1 1 -1 1 1 0 ,"
"QuantizedConvolution 721 1 1 719 721 1 128 32 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Mul 724 2 1 699 723 724 1 ,"
"QuantizedAdd 725 2 1 724 721 725 1 ,"
"QuantizedConvolution 726 1 1 725 726 1 32 16 1 1 1 1 0 0 0 -1 1 1 0 ,"
"BatchNormCxx 729 1 1 696 729 ,"
"Upsample 747 1 1 input 747 1 0 0 0 128 128 ,"
"QuantizedConvolution 748 1 1 747 749 1 3 128 3 3 1 1 1 1 1 -1 1 1 1 ,"
"QuantizedConvolution 753 1 1 749 753 1 128 32 3 3 1 1 1 1 1 -1 1 1 0 ,"
"QuantizedConvolution 751 1 1 749 751 1 128 32 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Mul 754 2 1 729 753 754 1 ,"
"QuantizedAdd 755 2 1 754 751 755 1 ,"
"PReLU 756 1 1 755 756 1 0 ,"
"QuantizedConvolution 760 1 1 756 760 1 32 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Upsample 778 1 1 input 778 1 0 0 0 128 128 ,"
"QuantizedConvolution 779 1 1 778 780 1 3 128 3 3 1 1 1 1 1 -1 1 1 1 ,"
"QuantizedConvolution 784 1 1 780 784 1 128 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"QuantizedConvolution 782 1 1 780 782 1 128 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Mul 785 2 1 760 784 785 1 ,"
"QuantizedAdd 786 2 1 785 782 786 1 ,"
"PReLU 787 1 1 786 787 1 0 ,"
"QuantizedConvolution 788 1 1 787 788 1 16 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"QuantizedAdd 789 2 1 726 788 789 1 ,"
"Upsample 817 1 1 789 817 1 0 0 0 256 256 ,"
"BatchNormCxx 820 1 1 817 820 ,"
"Upsample 838 1 1 input 838 1 0 0 0 256 256 ,"
"QuantizedConvolution 839 1 1 838 840 1 3 128 3 3 1 1 1 1 1 -1 1 1 1 ,"
"QuantizedConvolution 844 1 1 840 844 1 128 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"QuantizedConvolution 842 1 1 840 842 1 128 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Mul 845 2 1 820 844 845 1 ,"
"QuantizedAdd 846 2 1 845 842 846 1 ,"
"QuantizedConvolution 847 1 1 846 847 1 16 8 1 1 1 1 0 0 0 -1 1 1 0 ,"
"BatchNormCxx 850 1 1 817 850 ,"
"Upsample 868 1 1 input 868 1 0 0 0 256 256 ,"
"QuantizedConvolution 869 1 1 868 870 1 3 128 3 3 1 1 1 1 1 -1 1 1 1 ,"
"QuantizedConvolution 874 1 1 870 874 1 128 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"QuantizedConvolution 872 1 1 870 872 1 128 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Mul 875 2 1 850 874 875 1 ,"
"QuantizedAdd 876 2 1 875 872 876 1 ,"
"PReLU 877 1 1 876 877 1 0 ,"
"QuantizedConvolution 881 1 1 877 881 1 16 8 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Upsample 899 1 1 input 899 1 0 0 0 256 256 ,"
"QuantizedConvolution 900 1 1 899 901 1 3 128 3 3 1 1 1 1 1 -1 1 1 1 ,"
"QuantizedConvolution 905 1 1 901 905 1 128 8 3 3 1 1 1 1 1 -1 1 1 0 ,"
"QuantizedConvolution 903 1 1 901 903 1 128 8 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Mul 906 2 1 881 905 906 1 ,"
"QuantizedAdd 907 2 1 906 903 907 1 ,"
"PReLU 908 1 1 907 908 1 0 ,"
"QuantizedConvolution 909 1 1 908 909 1 8 8 3 3 1 1 1 1 1 -1 1 1 0 ,"
"QuantizedAdd 910 2 1 847 909 910 1 ,"
"PReLU 911 1 1 910 911 1 0 ,"
"QuantizedConvolution 912 1 1 911 912 1 8 3 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Tanh output 1 1 912 output ,"
